run_files/fixed_ucb/ucb05/backGround/constant/dynamicMeshDict_6DoF
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicOversetFvMesh;

dynamicOversetFvMeshCoeffs
{
//    layerRelax 0.3;
}

//motionSolverLibs ( "libfvMotionSolvers.so" );
//
//solver          displacementLaplacian;
//
//displacementLaplacianCoeffs
//{
//    diffusivity     uniform 1;
//}

solver          multiSolidBodyMotionSolver;

multiSolidBodyMotionSolverCoeffs
{
    movingZone
    {
        solidBodyMotionFunction tabulated6DoFMotion;
        CofG         (0.33 -0.5 0);
        timeDataFileName "$FOAM_CASE/constant/6DoF.dat";
    }
}

// ************************************************************************* //
